[
  [
    [
      ["What is the definition of denotation?"],
      ["The act of deleting a note or annotation", "incorrect"],
      ["The strict, literal, dictionary definition of a word", "correct"],
      ["The value of a variable", "incorrect"],
      ["An idea or feeling that a word invokes in addition to its literal or primary meaning", "incorrect"]
    ],
    [
      ["What is the definition of diction?"],
      ["Refers to the writer's word choices, especially with regard to their correctness, clearness, or effectiveness", "correct"],
      ["Archaic language for the word 'dictionary'", "incorrect"]
      ["A specific genre of fiction known for dramatic portayals of love and death", "incorrect"]
      ["Slang for the word 'addiction'", "incorrect"]
    ],
    [
      ["What is the definition of didactic?"],
      ["Filled with or characterized by a lively energy and excitement", "incorrect"],
      ["Works that have the primary aim of teaching or instructing, especially the teaching of morals or ethic principles", "correct"],
      ["Displaying or indicative of an offensively condescending manner", "incorrect"],
      ["One who frequents (a store, theater, restaurant, or other establishment) as a customer", "incorrect"]
    ],
    [
      ["What is the definition of euphemism?"],
      ["The painless killing of a patient suffering from an incurable and painful disease or in an irreversible coma. The practice is illegal in most countries", "incorrect"],
      ["A word or phrase considered pleasing to the ear", "incorrect"],
      ["A feeling or state of intense excitement and happiness", "incorrect"],
      ["A more agreeable or less offensive substitute for a generally unpleasant word or concept", "correct"]
    ],
    [
      ["What is the definition of extended metaphor?"],
      ["Any metaphor longer than a sentence", "incorrect"],
      ["A metaphor developed at great length, occurrng frequently in or throughout a book", "correct"],
      ["Another word for a theme present throughout a novel", "incorrect"],
      ["A metaphor that is used for more than a page to drive a specific point regarding the plot of a novel", "incorrect"]
    ],
    [
      ["What is the definition of figurative language?"],
      ["Speech or word use unfamiliar to an audience", "incorrect"],
      ["The act of learning a language through exposure as opposed to formal learning", "incorrect"],
      ["Writing or speech that is not intended to carry literal meaning and is usually meant to be imaginative and vivid", "correct"],
      ["A vernacular developed over many years and differing greatly from its origin tongue", "incorrect"]
    ]
  ],
  [
    [
      ["What is the chemical formula for acetate?"],
      ["C2H3O2,-", "correct"],
      ["C2O4,2-", "incorrect"],
      ["PO3,3-", "incorrect"],
      ["SCN,-", "incorrect"]
    ],
    [
      ["What is the chemical formula for ammonium?"],
      ["CO3,2-", "incorrect"],
      ["ClO3,-", "incorrect"],
      ["NH4,+", "correct"],
      ["NO3,-", "incorrect"]
    ],
    [
      ["What is the chemical formula for bromate?"],
      ["BrO3,-", "correct"],
      ["CrO4,2-", "incorrect"],
      ["MnO4,-", "incorrect"],
      ["ClO,-", "incorrect"]
    ],
    [
      ["What is the chemical formula for carbonate?"],
      ["BrO3,-", "incorrect"],
      ["CrO4,2-", "incorrect"],
      ["MnO4,-", "incorrect"],
      ["CO3,2-", "correct"]
    ],
    [
      ["What is the chemical formula for chlorate?"],
      ["BrO3,-", "incorrect"],
      ["ClO3,-", "correct"],
      ["MnO4,-", "incorrect"],
      ["ClO,-", "incorrect"]
    ],
    [
      ["What is the chemical formula for chlorite?"],
      ["ClO2,-", "correct"],
      ["CrO4,2-", "incorrect"],
      ["MnO4,-", "incorrect"],
      ["ClO,-", "incorrect"]
    ],
    [
      ["What is the chemical formula for chromate?"],
      ["ClO2,-", "incorrect"],
      ["CrO4,2-", "correct"],
      ["MnO4,-", "incorrect"],
      ["ClO,-", "incorrect"]
    ],
    [
      ["What is the chemical formula for cyanide?"],
      ["ClO2,-", "incorrect"],
      ["CrO4,2-", "incorrect"],
      ["MnO4,-", "incorrect"],
      ["CN,-", "correct"]
    ],
    [
      ["What is the chemical formula for dichromate?"],
      ["Cr2O7,2-", "correct"],
      ["CrO4,2-", "incorrect"],
      ["MnO4,-", "incorrect"],
      ["CN,-", "incorrect"]
    ],
    [
      ["What is the chemical formula for hydroxide?"],
      ["Cr2O7,2-", "incorrect"],
      ["CrO4,2-", "incorrect"],
      ["OH,-", "correct"],
      ["CN,-", "incorrect"]
    ],
    [
      ["What is the chemical formula for hypochlorite?"],
      ["Cr2O7,2-", "incorrect"],
      ["CrO4,2-", "incorrect"],
      ["OH,-", "incorrect"],
      ["ClO,-", "correct"],
    ],
    [
      ["What is the chemical formula for nitrate?"],
      ["Cr2O7,2-", "incorrect"],
      ["NO3,-", "correct"],
      ["OH,-", "incorrect"],
      ["ClO,-", "incorrect"],
    ]
  ]
]
    
      
